# start
# задача 1
# Создайте игру clicker, при нажатии на кнопку должно число увеличиваться на один

# задача 2
# Сделать игру найди кнопку, при нажатии на кнопку она перемещается в случайное место по координатам ,но не выходит за границы окна







# entry
# Задание 1. Написать программу калькулятор два entry для чисел
# кнопки выполняют действие 

# Задание 2.
# сделать страницу регистрации и входа пользователя 
# зарегистрировано может быть много пользователей







# Listbox
# Задание 1. Написать имитацию кассового аппарата для магазина.
# Кассир должен выбрать товар (кнопка) и ввести его количество, 
# затем выбрать следующий товар. По завершению ввода 
# вывести на экран всю сумму покупки.
# Товаров (кнопок) должно быть не меньше
# 4-х, должна отображаться их цена. 
# Предусмотреть неправильно вводимые данные.
# Должен быть список выбранных товаров.



